<?xml version="1.0" ?>
<net name="text-detection-0003" version="10">
	<layers>
		<layer id="0" name="Placeholder" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,768,1280"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Placeholder/reverse_input_channels18260/Concat18287_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul1_11423/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Placeholder/reverse_input_channels18262/Concat18271_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add1_11424/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Placeholder/reverse_input_channels/Concat18279_const" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="32,3,3,3" size="1728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_1255012555/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1740" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model/conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/re_lu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Mul1_11759/Fused_Mul_1349413496_const" type="Const" version="opset1">
			<data element_type="f16" offset="1804" shape="32,32,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_1255812563/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3852" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/conv2d_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/re_lu_1/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="1882318826_const" type="Const" version="opset1">
			<data element_type="f16" offset="3916" shape="32,1,1,3,3" size="576"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model/separable_conv2d/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Mul1_11231/Fused_Mul_1349813500_const" type="Const" version="opset1">
			<data element_type="f16" offset="4492" shape="32,32,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model/separable_conv2d/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1256612571/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6540" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model/separable_conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model/re_lu_2/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Mul1_11375/Fused_Mul_1350213504_const" type="Const" version="opset1">
			<data element_type="f16" offset="6604" shape="16,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_1257412579/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="7628" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model/conv2d_2/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Mul1_11471/Fused_Mul_1350613508_const" type="Const" version="opset1">
			<data element_type="f16" offset="7660" shape="96,16,1,1" size="3072"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_1258212587/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="10732" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model/conv2d_3/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model/re_lu_3/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="1879918802_const" type="Const" version="opset1">
			<data element_type="f16" offset="10924" shape="96,1,1,3,3" size="1728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model/separable_conv2d_1/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Mul1_11255/Fused_Mul_1351013512_const" type="Const" version="opset1">
			<data element_type="f16" offset="12652" shape="96,96,1,1" size="18432"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model/separable_conv2d_1/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_1259012595/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="31084" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model/separable_conv2d_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model/re_lu_4/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Mul1_11351/Fused_Mul_1351413516_const" type="Const" version="opset1">
			<data element_type="f16" offset="31276" shape="24,96,1,1" size="4608"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_1259812603/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="35884" shape="1,24,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model/conv2d_4/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Mul1_11795/Fused_Mul_1351813520_const" type="Const" version="opset1">
			<data element_type="f16" offset="35932" shape="144,24,1,1" size="6912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="data_add_1260612611/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="42844" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model/conv2d_5/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model/re_lu_5/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="1880718810_const" type="Const" version="opset1">
			<data element_type="f16" offset="43132" shape="144,1,1,3,3" size="2592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model/separable_conv2d_2/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Mul1_11519/Fused_Mul_1352213524_const" type="Const" version="opset1">
			<data element_type="f16" offset="45724" shape="144,144,1,1" size="41472"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model/separable_conv2d_2/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_1261412619/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="87196" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model/separable_conv2d_2/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model/re_lu_6/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Mul1_11495/Fused_Mul_1352613528_const" type="Const" version="opset1">
			<data element_type="f16" offset="87484" shape="24,144,1,1" size="6912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_1262212627/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="94396" shape="1,24,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model/conv2d_6/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model/add/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model/conv2d_43/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="94444" shape="16,24,1,1" size="768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model/conv2d_43/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model/conv2d_43/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="95212" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model/conv2d_43/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Mul1_11747/Fused_Mul_1353013532_const" type="Const" version="opset1">
			<data element_type="f16" offset="95244" shape="144,24,1,1" size="6912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_1263012635/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="102156" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model/conv2d_7/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model/re_lu_7/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="1881518818_const" type="Const" version="opset1">
			<data element_type="f16" offset="102444" shape="144,1,1,3,3" size="2592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model/separable_conv2d_3/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Mul1_11555/Fused_Mul_1353413536_const" type="Const" version="opset1">
			<data element_type="f16" offset="105036" shape="144,144,1,1" size="41472"/>
			<output>
				<port id="1" precision="FP16">
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/separable_conv2d_3/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_1263812643/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="146508" shape="1,144,1,1" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model/separable_conv2d_3/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model/re_lu_8/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Mul1_11387/Fused_Mul_1353813540_const" type="Const" version="opset1">
			<data element_type="f16" offset="146796" shape="32,144,1,1" size="9216"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_1264612651/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="156012" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model/conv2d_8/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Mul1_11507/Fused_Mul_1354213544_const" type="Const" version="opset1">
			<data element_type="f16" offset="156076" shape="192,32,1,1" size="12288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model/conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1265412659/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="168364" shape="1,192,1,1" size="384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model/conv2d_9/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model/re_lu_9/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1880318806_const" type="Const" version="opset1">
			<data element_type="f16" offset="168748" shape="192,1,1,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model/separable_conv2d_4/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Mul1_11291/Fused_Mul_1354613548_const" type="Const" version="opset1">
			<data element_type="f16" offset="172204" shape="192,192,1,1" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model/separable_conv2d_4/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="data_add_1266212667/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="245932" shape="1,192,1,1" size="384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model/separable_conv2d_4/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model/re_lu_10/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Mul1_11591/Fused_Mul_1355013552_const" type="Const" version="opset1">
			<data element_type="f16" offset="246316" shape="32,192,1,1" size="12288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="model/conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_1267012675/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="258604" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model/conv2d_10/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model/add_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Mul1_11663/Fused_Mul_1355413556_const" type="Const" version="opset1">
			<data element_type="f16" offset="258668" shape="192,32,1,1" size="12288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model/conv2d_11/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_1267812683/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="270956" shape="1,192,1,1" size="384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model/conv2d_11/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="model/re_lu_11/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="1879118794_const" type="Const" version="opset1">
			<data element_type="f16" offset="271340" shape="192,1,1,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="model/separable_conv2d_5/separable_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Mul1_11543/Fused_Mul_1355813560_const" type="Const" version="opset1">
			<data element_type="f16" offset="274796" shape="192,192,1,1" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="model/separable_conv2d_5/separable_conv2d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="data_add_1268612691/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="348524" shape="1,192,1,1" size="384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="model/separable_conv2d_5/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="model/re_lu_12/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Mul1_11723/Fused_Mul_1356213564_const" type="Const" version="opset1">
			<data element_type="f16" offset="348908" shape="32,192,1,1" size="12288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="model/conv2d_12/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="data_add_1269412699/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="361196" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="model/conv2d_12/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model/add_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Mul1_11459/Fused_Mul_1356613568_const" type="Const" version="opset1">
			<data element_type="f16" offset="361260" shape="192,32,1,1" size="12288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="model/conv2d_13/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="data_add_1270212707/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="373548" shape="1,192,1,1" size="384"/>
			<output>
